In [2]:
from datascience import *
import matplotlib.pylab as plt
import numpy as np
import plotly.express as px
import pandas as pd

# Operaciones group y pivot

In [3]:

# Crear la tabla con m√°s filas
tabla_frutas = Table().with_columns(
    'Fruta', np.array(['manzana', 'pera', 'manzana', 'fresa', 'pera', 'fresa', 
                       'banano', 'mango', 'kiwi', 'banano', 'mango', 'fresa', 
                       'kiwi', 'pera', 'banano', 'manzana', 'pera', 'fresa', 
                       'mango', 'manzana']),
    'Color', np.array(['rojo', 'verde', 'verde', 'rojo', 'verde', 'rojo', 
                       'verde', 'naranja', 'verde', 'amarillo', 'naranja', 'rojo', 
                       'verde', 'verde', 'amarillo', 'rojo', 'verde', 'rojo', 
                       'naranja', 'rojo']),
    'Precio', np.array([2500, 3500, 2500, 4000, 3500, 4000, 
                              1500, 3000, 4500, 1500, 3000, 4000, 
                              4500, 3500, 1500, 2500, 3500, 4000, 
                              3000, 2500])
)

In [4]:
tabla_frutas

Fruta   | Color    | Precio
manzana | rojo     | 2500
pera    | verde    | 3500
manzana | verde    | 2500
fresa   | rojo     | 4000
pera    | verde    | 3500
fresa   | rojo     | 4000
banano  | verde    | 1500
mango   | naranja  | 3000
kiwi    | verde    | 4500
banano  | amarillo | 1500
... (10 rows omitted)

In [5]:
tabla_frutas.group(["Fruta", "Color"], np.mean)

Fruta   | Color    | Precio mean
banano  | amarillo | 1500
banano  | verde    | 1500
fresa   | rojo     | 4000
kiwi    | verde    | 4500
mango   | naranja  | 3000
manzana | rojo     | 2500
manzana | verde    | 2500
pera    | verde    | 3500

In [188]:
tabla_frutas.pivot("Fruta", "Color")

Color    | banano | fresa | kiwi | mango | manzana | pera
amarillo | 2      | 0     | 0    | 0     | 0       | 0
naranja  | 0      | 0     | 0    | 3     | 0       | 0
rojo     | 0      | 4     | 0    | 0     | 3       | 0
verde    | 1      | 0     | 2    | 0     | 1       | 4

In [189]:
tabla_frutas.pivot("Fruta", "Color", values="Precio", collect=np.mean)

Color    | banano | fresa | kiwi | mango | manzana | pera
amarillo | 1500   | 0     | 0    | 0     | 0       | 0
naranja  | 0      | 0     | 0    | 3000  | 0       | 0
rojo     | 0      | 4000  | 0    | 0     | 2500    | 0
verde    | 1500   | 0     | 4500 | 0     | 2500    | 3500

# Libros

In [191]:
from datascience import *

# Crear la tabla con 20 libros
libros = Table().with_columns(
    'Titulo', make_array(
        'Cien A√±os de Soledad', 'El Quijote', '1984', 'Orgullo y Prejuicio', 'Crimen y Castigo', 
        'El Principito', 'Don Juan Tenorio', 'Matar a un Ruise√±or', 'La Odisea', 'El Gran Gatsby',
        'Fahrenheit 451', 'La Metamorfosis', 'El Retrato de Dorian Gray', 'Hamlet', 'Macbeth',
        'La Il√≠ada', 'El Se√±or de los Anillos', 'Dr√°cula', 'Los Miserables', 'La Divina Comedia'),
    
    'Autor', make_array(
        'Gabriel Garc√≠a M√°rquez', 'Miguel de Cervantes', 'George Orwell', 'Jane Austen', 'Fi√≥dor Dostoyevski', 
        'Antoine de Saint-Exup√©ry', 'Jos√© Zorrilla', 'Harper Lee', 'Homero', 'F. Scott Fitzgerald', 
        'Ray Bradbury', 'Franz Kafka', 'Oscar Wilde', 'William Shakespeare', 'William Shakespeare',
        'Homero', 'J. R. R. Tolkien', 'Bram Stoker', 'Victor Hugo', 'Dante Alighieri'),
    
    'Genero', make_array(
        'Ficci√≥n', 'Cl√°sico', 'Ciencia Ficci√≥n', 'Romance', 'Cl√°sico', 
        'Ficci√≥n', 'Cl√°sico', 'Ficci√≥n', 'Cl√°sico', 'Ficci√≥n',
        'Ciencia Ficci√≥n', 'Ficci√≥n', 'Cl√°sico', 'Cl√°sico', 'Cl√°sico',
        'Cl√°sico', 'Fantas√≠a', 'Terror', 'Cl√°sico', 'Cl√°sico'),
    
    'Precio (COP)', make_array(
        45000, 60000, 40000, 38000, 52000, 
        35000, 30000, 45000, 32000, 42000,
        37000, 25000, 48000, 51000, 50000,
        30000, 70000, 35000, 68000, 63000),
    
    'Anio de Publicacion', make_array(
        1967, 1605, 1949, 1813, 1866,
        1943, 1844, 1960, 'Siglo VIII a.C.', 1925,
        1953, 1915, 1890, 1603, 1606,
        'Siglo VIII a.C.', 1954, 1897, 1862, 1320),
    
    'Calificacion (1-5)', make_array(
        4.8, 4.9, 4.7, 4.6, 4.8, 
        4.7, 4.4, 4.9, 4.6, 4.8,
        4.6, 4.5, 4.7, 4.9, 4.8,
        4.6, 4.9, 4.7, 4.9, 4.9)
)

In [192]:
libros.group("Genero", np.mean)

Genero          | Titulo mean | Autor mean | Precio (COP) mean | Anio de Publicacion mean | Calificacion (1-5) mean
Ciencia Ficci√≥n |             |            | 38500             |                          | 4.65
Cl√°sico         |             |            | 48400             |                          | 4.75
Fantas√≠a        |             |            | 70000             |                          | 4.9
Ficci√≥n         |             |            | 38400             |                          | 4.74
Romance         |             |            | 38000             |                          | 4.6
Terror          |             |            | 35000             |                          | 4.7

In [193]:
libros.where("Genero", are.equal_to("Cl√°sico")).column("Precio (COP)").sum()

484000

# Joins

In [7]:
# Tabla de estudiantes con IDs y nombres
students = Table().with_columns(
    'ID', [1, 2, 3, 4],
    'Name', ['Alice', 'Bob', 'Charlie', 'David']
)

students

ID   | Name
1    | Alice
2    | Bob
3    | Charlie
4    | David

In [9]:
# Tabla de calificaciones con IDs y calificaciones
grades = Table().with_columns(
    'ID', [1, 2, 3, 5],
    'Grade', ['A', 'B', 'C', 'D']
)

grades

ID   | Grade
1    | A
2    | B
3    | C
5    | D

In [10]:
# Realizar un join en la columna 'ID'
merged_table = students.join('ID', grades)

# Mostrar la tabla resultante
merged_table.show()

# Ejercicios de clase √°rboles udea

## √Årboles de la Universidad de Antioquia

En este ejercicio exploraremos un conjunto de datos con informaci√≥n sobre √°rboles localizados en el campus de la Universidad de Antioquia.  
Aplicaremos operaciones de filtrado, agrupamiento, exploraci√≥n de especies y visualizaci√≥n geogr√°fica.

1. Lee el archivo `arboles_udea_localizacion.csv` en una tabla llamada `arboles` y selecciona las columnas:
`"FAMILIA"`, `"Nombre com√∫n"`, `"Nombre cient√≠fico"`, `"X"`, `"Y"`, `"ALTURA TOTAL"`, `"ALTURA DE COPA"`, `"DIAMETRO_MAYOR "`, `"DIAMETRO_MENOR"`.



2. Muestra los nombres de las columnas de la tabla.  
¬øQu√© funci√≥n utilizas para hacerlo?



3. Filtra los √°rboles cuya **altura total** sea mayor a 20 metros.  
¬øCu√°ntos √°rboles cumplen con esta condici√≥n?

4. Crea una funci√≥n empleando `apply` para dar la medida de m en cm.


4. Agrupa la tabla por la columna `"FAMILIA"` y calcula el **promedio de altura total** para cada familia.  
Muestra el resultado ordenado de mayor a menor.



5. ¬øQu√© familia tiene la **mayor altura promedio**?  
¬øY cu√°l tiene la **menor altura promedio**?


6. Muestra los nombres comunes de todas las especies presentes en el conjunto de datos.  
¬øQu√© funci√≥n utilizas para obtener una lista sin repeticiones?



7. Filtra √∫nicamente los √°rboles de la familia `"MORACEAE"` y realiza una tabla pivote (`pivot`) con la familia en las filas y el nombre com√∫n en las columnas.  
¬øQu√© observas en el resultado?


8. Convierte la tabla `arboles_udea` en un `DataFrame` de pandas con las columnas `"Y"`, `"X"` y `"Nombre com√∫n"`.  
Gu√°rdalo en una variable llamada `data_arboles`.

```
import pandas as pd
data_arboles = arboles_udea.select('Y', 'X', 'Nombre com√∫n').to_df()
```

9. Utiliza `plotly.express` para crear un **mapa interactivo** con los puntos que representan la ubicaci√≥n de los √°rboles.  
Cada punto debe mostrar el nombre com√∫n al pasar el cursor.  

- ¬øQu√© par√°metro define el color de los puntos?  
- ¬øQu√© par√°metro controla el nivel de zoom?  
- ¬øQu√© representa cada punto verde en el mapa?

Ayuda:
```python
fig = px.scatter_mapbox(
    data_arboles,
    lat='X',
    lon='Y',
    hover_name='Nombre com√∫n',
    color_discrete_sequence=['green'],
    zoom=16,
    height=600,
    title='Mapa interactivo de √°rboles sobre OpenStreetMap'
)
fig.update_layout(mapbox_style='open-street-map')
fig.show()
```  




10. Modifica el mapa cambiando el estilo de fondo (`mapbox_style`).  
¬øQu√© otros estilos gratuitos puedes usar adem√°s de `'open-street-map'`?